In [1]:
import pandas as pd
import datetime, time
import numpy as np
from sqlalchemy import create_engine
import os

In [2]:
pd.set_option('display.max_columns', 20)

In [3]:
astr_df = pd.read_csv('CSVs/astronauts.csv')
spacewalks_df = pd.read_csv('CSVs/space_walks.csv')
spacemissions_df = pd.read_csv('CSVs/space_missions.csv')
global_launches_df = pd.read_csv('CSVs/global_space_launches.csv')

In [4]:
astr_df.head(1)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN

In [5]:
spacewalks_df.head(1)

,EVA #,Country,Crew,Vehicle,Date,Duration,Purpose
0,1.0,USA,Ed White,Gemini IV,06/03/1965,0:36,First U.S. EVA. Used HHMU and took photos. G...

In [6]:
spacemissions_df.head(1)

,Unnamed: 0,Unnamed: 0.1,Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission
0,0,0,SpaceX,"LC-39A, Kennedy Space Center, Florida, USA","Fri Aug 07, 2020 05:12 UTC",Falcon 9 Block 5 | Starlink V1 L9 & BlackSky,StatusActive,50.0,Success

In [7]:
global_launches_df.head(1)

,Company Name,Location,Detail,Status Rocket,Rocket,Status Mission,Country of Launch,Companys Country of Origin,Private or State Run,DateTime,Year,Month,Day,Date,Time
0,SpaceX,"LC-39A, Kennedy Space Center, Florida, USA",Falcon 9 Block 5 | Starlink V1 L9 & BlackSky,StatusActive,50.0,Success,USA,USA,P,2020-08-07 05:12:00+00:00,2020,8,7,07/08/2020,05:12

## Dropping columns

In [8]:
spacemissions_df.drop(labels=['Unnamed: 0', 'Unnamed: 0.1'], axis=1, inplace=True)
global_launches_df.drop(labels=['DateTime','Year','Month','Day','Time'], axis=1, inplace=True)

## Date conversions

In [9]:
date_df = pd.DataFrame({"Global Launches Dates": global_launches_df.Date, "Spacemissions Dates": spacemissions_df.Datum
                       ,"Spacewalks Dates": spacewalks_df.Date})
date_df.head()

  Global Launches Dates         Spacemissions Dates   Spacewalks Dates
0            07/08/2020  Fri Aug 07, 2020 05:12 UTC         06/03/1965
1            06/08/2020  Thu Aug 06, 2020 04:01 UTC  March 16-17, 1966
2            04/08/2020  Tue Aug 04, 2020 23:57 UTC         06/05/1966
3            30/07/2020  Thu Jul 30, 2020 21:25 UTC         07/19/1966
4            30/07/2020  Thu Jul 30, 2020 11:50 UTC         07/20/1966

In [10]:
date_df.dtypes

Global Launches Dates    object
Spacemissions Dates      object
Spacewalks Dates         object
dtype: object

In [11]:
## Splicing string to get rid of time and timezone
spacemissions_df.Datum = spacemissions_df.Datum.apply(lambda x: x[0:16])

In [12]:
# Built-in Pandas datetime function

global_launches_df.Date = pd.to_datetime(global_launches_df.Date, format='%d/%m/%Y', errors = "coerce")

spacemissions_df.Datum = pd.to_datetime(spacemissions_df.Datum, format= '%a %b %d, %Y', errors='coerce')

spacewalks_df.Date = pd.to_datetime(spacewalks_df.Date, format= "%m/%d/%Y", errors="coerce")

In [13]:
# Re-running date_df to verify conversions were successful

In [14]:
date_df = pd.DataFrame({"Global Launches Dates": global_launches_df.Date, "Spacemissions Dates": spacemissions_df.Datum
                       ,"Spacewalks Dates": spacewalks_df.Date})
date_df.head()

  Global Launches Dates Spacemissions Dates Spacewalks Dates
0            2020-08-07          2020-08-07       1965-06-03
1            2020-08-06          2020-08-06              NaT
2            2020-08-04          2020-08-04       1966-06-05
3            2020-07-30          2020-07-30       1966-07-19
4            2020-07-30          2020-07-30       1966-07-20

In [15]:
date_df.dtypes

Global Launches Dates    datetime64[ns]
Spacemissions Dates      datetime64[ns]
Spacewalks Dates         datetime64[ns]
dtype: object

## Renaming columns for ease of access in pgAdmin

In [16]:
global_launches_df.columns = ['company_name', 'location', 'detail', 'status_rocket', 'rocket',
       'status_mission', 'country_of_launch', 'company_country_origin',
       'private_or_state', 'date']

spacemissions_df.columns = ['company_name', 'location', 'date', 'detail', 'status_rocket',
       'rocket', 'status_mission']

spacewalks_df.columns = ['eva#', 'country', 'crew', 'vehicle', 'date', 'duration', 'purpose']

astr_df.columns = ['name', 'year', 'group', 'status', 'birth_date', 'birth_place',
       'gender', 'alma_mater', 'undergraduate_major', 'graduate_major',
       'military_rank', 'military_branch', 'space_flights',
       'space_flight_hours', 'space_walks', 'space_walks_hours', 'missions',
       'death_date', 'death_mission']

## Creating connection to space_db  and converting dataframes to sql tables

In [ ]:
password = os.environ.get('postgres_password')

In [ ]:
engine = create_engine(f"postgresql://postgres:{password}@localhost:5432/space_db")

In [ ]:
global_launches_df.to_sql("global_launches", engine)

spacemissions_df.to_sql("space_missions", engine)

spacewalks_df.to_sql("spacewalks", engine)

In [ ]:
astr_df.to_sql("astronauts", engine)